const translations = {
  ua: {
    // Navigation
    'nav.top': 'Наверх',
    'nav.about': 'Про мене',
    'nav.works': 'Роботи',
    'nav.why': 'Чому саме я?',
    'nav.contact': 'Контакти',

    // Hero section
    'hero.title': 'О, привіт! Давай знайомитись!',
    'hero.description': 'Це - моя персональна сторінка. Тут ви можете подивитись мої роботи та замовити щось для себе. А також дізнатись трохи більше про мене. Велкам!',

    // About section
    'about.title': 'Про мене',
    'about.text': 'Мене звати Діана. Я родом з українського міста Вінниці. Саме там я вперше познайомилась з графічними редакторами у комп’ютерній школі, ще у свої 10. З того часу мені цікаво створювати та експериментувати в фотошопі та ілюстраторі. Після школи я хотіла йти на архітектора, але вступила на поліграфію. Трохи поверставши майбутні брошурки та журнали - перейшла на заочну форму, щоб втілювати теорію у практику. Працювала у маркетинговій сфері, допомагаючи компаніям створювати візуальне наповнення.\n' +
      'Тепер я живу у Львові та хочу рухатись далі. Все ще верстка, тільки тепер - верстка сайтів. Цікаво, що буде далі?',

    // My works section
    "my-works.title": "Мої роботи",
    "my-works.subtitle": "як графічного дизайнера",
    "my-works.button": "Більше робіт",

    // Why me section
    "why-me.subtitle--first": "Чим я можу допомогти?",
    "why-me.subtitle--second": "Які терміни роботи та її вартість?",
    "why-me.text--first": 'Думаю, графічний дизайн покликаний, щоб допомогти справі, якою ви займаєтесь. стати видимою та більш зрозумілою для людей. Його завдання донести вашій аудиторії цінність вашої справи чи продукту. Вірю, що дизайн - не окрема сфера, але доповнююча. Тому в роботі я ставлю запитання “Чим я можу допомогти?”',
    "why-me.text--second": "Творча робота - це часто не про чіткі терміни роботи, але кожен проект має свої рамки. Все залежить від бази, яку ви вже маєте. Чим з більшою кількістю матеріалу клієнт приходить - тим більше він пришвидшує роботу дизайнера.\n" +
      "\n" + "Вартість роботи має дві варіації: або погодинна оплата, або попроектна. Ви обираєте формат, який вам зручніше.",

    // Testimonials section
    "testimonials.title": "Відгуки моїх клієнтів",
  },
  en: {
    // Hero section
    'hero.title': "Oh, hi! Let's get acquainted!",
    'hero.description': 'This is my personal page. Here you can see my works and order something for yourself. And also learn a little more about me. Welcome!',

    // About section
    'about.title': 'About me',
    'about.text': "My name is Diana. I'm from Ukrainian city Vinnytsia...",

    // Navigation
    'nav.top': 'Top',
    'nav.about': 'About',
    'nav.works': 'Works',
    'nav.why': 'Why me?',
    'nav.contact': 'Contact'
  }
};

export default translations;
